package com.waiter.waiter;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class WaiterApplication {

	public static void main(String[] args) {
		SpringApplication.run(WaiterApplication.class, args);
	}

}
//Заявки за добавяне на ястия и напитки в менюто
//INSERT INTO `dishes`(`name`,`price`, `quantity`,`dish_quantity_type`,`description`, `dish_type`)
//VALUES ('Шопска салата','8.9','500','гр.','домати, червени чушки, краставици, лук, магданоз, маслини, сирене','Салати'),
//('Овчарска салата','9.6','400','гр.','домати, краставици, чушки, лук, гъби, сирене, шунка, кашкавал, яйца, магданоз, маслини ','Салати'),
//('Хрупкави пилешки филенца','7','200','гр.','пилешки филенца с чеснов сос','Предястия'),
//('Пържени картофи','3','300','гр.','','Предястия'),
//('Пържени картофи със сирене','4','350','гр.','','Предястия'),
//('Пица Моцарела','5.5','400','гр.','доматен сос, моцарела,  босилек
//','Основно'),
//('Спагети Болонезе','7','450','гр.','мляно месо, доматено пюре, пармезан, риган, зехтин, босилек','Основно'),
//('Кюфте','1.5','1','бр.','','Барбекю/Грил'),
//('Кебапче','1.5','1','бр.','','Барбекю/Грил'),
//('Пилешко шишче','3.5','1','бр.','','Барбекю/Грил'),
//('Свинско шишче','3','1','бр.','','Барбекю/Грил'),
//('Филе от акула','14','400','гр.','','Морски дарове'),
//('Пъстърва','8','300','гр.','','Морски дарове'),
//('Рибена супа','3.5','300','гр.','','Морски дарове'),
//('Бисквитена торта','5','200','гр.','','Десерти'),
//('Тирамису','6','200','гр.','','Десерти'),
//('Торта със сезонни плодове','5.5','300','гр.','','Десерти');
//
//INSERT INTO `drinks`(`name`,`price`, `quantity`,`drink_quantity_type`,`description`, `drink_type`)
//VALUES('Кафе експресо','3','100','мл.','','Топли напитки'),
//('Виенско кафе','3.5','150','мл.','','Топли напитки'),
//('Билков чай','2','250','мл.','','Топли напитки'),
//('Плодов чай','2','250','мл.','','Топли напитки'),
//('Горещ шоколад','3','250','мл.','','Топли напитки'),
//('Мляко с какао','3.5','250','мл.','','Топли напитки'),
//('Минерална вода','2','500','мл.','','Безалкохолни напитки'),
//('Натурален сок','3','250','мл.','','Безалкохолни напитки'),
//('Кола','3','200','мл.','','Безалкохолни напитки'),
//('Бира','3','500','мл.','','Алкохолни напитки'),
//('Бяло вино','3','200','мл.','','Алкохолни напитки'),
//('Червено вино','3','200','мл.','','Алкохолни напитки'),
//('Ликьор Бейлис','8','200','мл.','','Алкохолни напитки'),
//('Ракия','5','100','мл.','','Алкохолни напитки'),
//('Уиски','5','50','мл.','','Алкохолни напитки')